{"pageDetails":{"title":"The history of marketing","description":null,"date":"2016-08-12T00:00:00.000Z","categories":["marketing"],"author_staff_member":"james","show_comments":true,"excerpt_html":"The beginnings of digital marketing technology can be traced back to the 1980's, when computers became sophisticated enough to store huge volumes of customer information. For a brief moment, no one knew what would happen in digital marketing, but by the 90's it all became clear.","slug":"2016-08-12-the-history-of-marketing","content_html":"<p>The beginnings of digital marketing technology can be traced back to the 1980's, when computers became sophisticated enough to store huge volumes of customer information. For a brief moment, no one knew what would happen in digital marketing, but by the 90's it all became clear.</p>\n<p><img src=\"https://unsplash.it/960/600?image=133\" alt=\"Cars\"></p>\n<p>The history of marketing is to a large extent a product of Internet's history as markets have adapted to keep abreast of changes and keep up with the way the major Search Engines rank web pages. Major changes include, in chronological order:</p>\n<p>1991- Gopher: A network protocol, one of the very first query and search tools. Gopher was widely used for a couple of years, but usage has now fallen off, with barely 100 Gopher servers now indexed. 2. 1994- Launch of Yahoo, which was formerly known as &quot;Jerry´s Guide to the World Wide Web&quot; after one of its founders, Jerry Yang. Yahoo received in its first year over 1 million hits.</p>\n<h2>Academic studies</h2>\n<p>The study of the history of marketing as an academic field emerged only recently. Controversies and disputes abound in the field. The publication in 1976 of the book The History of Marketing Thought, by Robert Bartels marks a turning-point in marketing thought. Since then, academics specializing in marketing decided to imitate economics, distinguishing theory and practice. Two different fields of study emerged:</p>\n<p>the history of marketing thought, giving theoretical accounts\nmarketing history, focusing on the history of marketing practice\nThis division parallels the distinction between the history of economic thought and economic history.</p>\n<p><img src=\"https://unsplash.it/960/600?image=175\" alt=\"Clock\"></p>\n<p>Practitioners of the history of marketing thought note that both practitioners and academics know relatively little about the field.[citation needed] But history has significance for academics because it helps to define the baselines upon which they can recognize change and evolve marketing theory.On the other hand, proponents of marketing history argue that one cannot fully compare the marketing field with economics and hence suggest the impracticality of divorcing theory and practice. First, marketing scholars seldom engage in the practice of marketing as much as economists engage in the development and execution of public policies. Second, business people innovate in the marketing field, and the history of marketing will remain incomplete if one dissociates academia from practitioners.</p>\n<p><img src=\"https://unsplash.it/960/600?image=766\" alt=\"Coffee\"></p>\n<p>The following sections discuss both approaches to the history of marketing, closing with a debate about the standard chronology of marketing, a widely known hypothesis about the history of marketing, but one that historians in the marketing field have challenged.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/History_of_marketing\">source</a>: Wikipedia</p>\n"},"author":{"name":"James Lopez","description":null,"position":"Designer","image_path":"https://unsplash.it/600/503?image=1062&a=.png","twitter":"CloudCannon","post":"2020-08-27-effective-upselling-techniques","slug":"james","content_html":""},"nextPost":{"title":"Definition of sales","description":null,"date":"2016-08-06T00:00:00.000Z","categories":["sales"],"author_staff_member":"anna","show_comments":true,"excerpt_html":"A person or organization expressing an interest in acquiring the offered item of value is referred to as a potential buyer, prospective customer or prospect. Buying and selling are understood to be two sides of the same &quot;coin&quot; or transaction. Both seller and buyer engage in a process of negotiation to consummate the exchange of values. The exchange, or selling, process has implied rules and identifiable stages.","slug":"2016-08-06-definition-of-sales","content_html":"<p>A person or organization expressing an interest in acquiring the offered item of value is referred to as a potential buyer, prospective customer or prospect. Buying and selling are understood to be two sides of the same &quot;coin&quot; or transaction. Both seller and buyer engage in a process of negotiation to consummate the exchange of values. The exchange, or selling, process has implied rules and identifiable stages.</p>\n<p><img src=\"https://unsplash.it/960/600?image=593\" alt=\"Tiger\"></p>\n<p>It is implied that the selling process will proceed fairly and ethically so that the parties end up nearly equally rewarded. The stages of selling, and buying, involve getting acquainted, assessing each party’s need for the other’s item of value, and determining if the values to be exchanged are equivalent or nearly so, or, in buyer's terms, &quot;worth the price.” Sometimes, sellers have to use their own experiences when selling products with appropriate discounts.</p>\n<h2>Management point of view</h2>\n<p>From a management viewpoint it is thought of as a part of marketing, although the skills required are different. Sales often forms a separate grouping in a corporate structure, employing separate specialist operatives known as salespersons (singular: salesperson). Selling is considered by many to be a sort of persuading &quot;art&quot;. Contrary to popular belief, the methodological approach of selling refers to a systematic process of repetitive and measurable milestones, by which a salesman relates his or her offering of a product or service in return enabling the buyer to achieve their goal in an economic way. While the sales process refers to a systematic process of repetitive and measurable milestones, the definition of the selling is somewhat ambiguous due to the close nature of advertising, promotion, public relations, and direct marketing.</p>\n<p><img src=\"https://unsplash.it/960/600?image=672\" alt=\"Bus\"></p>\n<p>Selling is the profession-wide term, much like marketing defines a profession. Recently, attempts have been made to clearly understand who is in the sales profession, and who is not. There are many articles looking at marketing, advertising, promotions, and even public relations as ways to create a unique transaction.</p>\n<h2>Common terms</h2>\n<p>Two common terms used to describe a salesperson are &quot;Farmer&quot; and &quot;Hunter&quot;. The reality is that most professional sales people have a little of both. A hunter is often associated with aggressive personalities who use aggressive sales technique. In terms of sales methodology a hunter refers to a person whose focus is on bringing in and closing deals. This process is called “sales capturing”. An example is a commodity sale such as a long distance sales person, shoe sales person and to a degree a car sales person. Their job is to find and convert buyers. A sales farmer is someone who creates sales demand by activities that directly influence and alter the buying process.</p>\n<p><img src=\"https://unsplash.it/960/600?image=1027\" alt=\"Person\"></p>\n<h2>Systems approach</h2>\n<p>Many believe that the focus of selling is on the human agents involved in the exchange between buyer and seller. Effective selling also requires a systems approach, at minimum involving roles that sell, enable selling, and develop sales capabilities. Selling also involves salespeople who possess a specific set of sales skills and the knowledge required to facilitate the exchange of value between buyers and sellers that is unique from marketing, advertising, etc.</p>\n<p><img src=\"https://unsplash.it/960/600?image=601\" alt=\"Plant\"></p>\n<p>Within these three tenets, the following definition of professional selling is offered by the American Society for Training and Development (ASTD):</p>\n<p>“The holistic business system required to effectively develop, manage, enable, and execute a mutually beneficial, interpersonal exchange of goods and/or services for equitable value.”\nTeam selling is one way to influence sales. Team selling is “a group of people representing the sales department and other functional areas in the firm, such as finance, production, and research and development”. (Spiro) Team selling came about in the 1990s through total quality management (TQM). TQM occurs when companies work to improve their customer satisfaction by constantly improving all of their operations.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Sales\">source</a>: Wikipedia</p>\n"}}